/*------------------------------------------------------------------------------------------------*/
/* Author: Alfred Gerke (AGE)                                                  
/* Date: 2019-03-01                                                        
/* Description: Es werden Constraints und Grants angelegt        
/*                                                                              
/*------------------------------------------------------------------------------------------------*/
/* - Das Script arbeitet mit Befehlen der SQL-Erweiterung für FB 3.0x   
/* - Das Script ist für die Ausführung im ISQL erstellt worden
/* - Ein Datenbank-Connect wird vorausgesetzt
/*   
/*------------------------------------------------------------------------------------------------*/
/* History: 2019-02-22
/*          Script erstellen
/*   
/*------------------------------------------------------------------------------------------------*/

/* Constraints -----------------------------------------------------------------------------------*/
select SUCCESS, LOG_MESSAGE
from SP_CREATE_ALL_CONSTRAINTS;

COMMIT WORK;

/* KeyWords --------------------------------------------------------------------------------------*/

/* Styleguid -------------------------------------------------------------------------------------*/

/* Grants ----------------------------------------------------------------------------------------*/
execute
procedure GRANT_ALL;

COMMIT WORK;